
## Plan Result

[CI link](https://github.com/clov3r-cc/infra/actions/runs/21556063946)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 2 to change, 2 to destroy.</code></pre>

* Update
  * ansible_host.zabbix_server[&#34;01&#34;]
  * ansible_host.zabbix_server[&#34;02&#34;]
* Replace
  * proxmox_vm_qemu.zabbix_server[&#34;01&#34;]
  * proxmox_vm_qemu.zabbix_server[&#34;02&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # ansible_host.zabbix_server["01"] will be updated in-place
  ~ resource "ansible_host" "zabbix_server" {
        id        = "prd-zbx-01"
      ~ name      = "prd-zbx-01" -> "prod-zbbx-01"
      ~ variables = {
          - "ansible_host"    = "192.168.21.14"
          - "heartbeat_nw_ip" = "192.168.91.1"
          - "host_index"      = "1"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # ansible_host.zabbix_server["02"] will be updated in-place
  ~ resource "ansible_host" "zabbix_server" {
        id        = "prd-zbx-02"
      ~ name      = "prd-zbx-02" -> "prod-zbbx-02"
      ~ variables = {
          - "ansible_host"    = "192.168.21.15"
          - "heartbeat_nw_ip" = "192.168.91.2"
          - "host_index"      = "2"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # proxmox_vm_qemu.zabbix_server["01"] is tainted, so must be replaced
-/+ resource "proxmox_vm_qemu" "zabbix_server" {
      ~ boot                      = "c" -> (known after apply)
      ~ bootdisk                  = "virtio0" -> (known after apply)
      - cores                     = 0 -> null
      ~ current_node              = "prod-prox-01" -> (known after apply)
      + default_ipv4_address      = (known after apply)
      + default_ipv6_address      = (known after apply)
      ~ id                        = "prod-prox-01/qemu/102" -> (known after apply)
      ~ linked_vmid               = 0 -> (known after apply)
        name                      = "prod-zbbx-01"
      - numa                      = false -> null
      ~ reboot_required           = false -> (known after apply)
      - sockets                   = 0 -> null
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
        tags                      = "prod;terraform;zabbix;zabbix-server"
      ~ unused_disk               = [] -> (known after apply)
      - vcpus                     = 0 -> null
      ~ vm_state                  = "stopped" -> "running"
        # (38 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide0 {
                  - ignore = false -> null

                    # (1 unchanged block hidden)
                }
            }
          ~ virtio {
              ~ virtio0 {
                  - ignore = false -> null

                  ~ disk {
                      - discard              = false -> null
                      ~ id                   = 0 -> (known after apply)
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (19 unchanged attributes hidden)
                    }
                }
              ~ virtio1 {
                  - ignore = false -> null

                  ~ disk {
                      - discard              = false -> null
                      ~ id                   = 1 -> (known after apply)
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (19 unchanged attributes hidden)
                    }
                }
            }
        }

      ~ network {
            id        = 0
          ~ macaddr   = "bc:24:11:13:dc:f6" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }
      ~ network {
            id        = 1
          ~ macaddr   = "bc:24:11:a4:ec:70" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      ~ smbios (known after apply)
      - smbios {
          - uuid         = "b3a8c53b-0631-4c98-a449-6db6249082ee" -> null
            # (6 unchanged attributes hidden)
        }

      - vga {
          - memory = 0 -> null
          - type   = "serial0" -> null
        }
      + vga {
          + type = "serial0"
        }

        # (3 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.zabbix_server["02"] is tainted, so must be replaced
-/+ resource "proxmox_vm_qemu" "zabbix_server" {
      ~ boot                      = "c" -> (known after apply)
      ~ bootdisk                  = "virtio0" -> (known after apply)
      - cores                     = 0 -> null
      ~ current_node              = "prod-prox-01" -> (known after apply)
      + default_ipv4_address      = (known after apply)
      + default_ipv6_address      = (known after apply)
      ~ id                        = "prod-prox-01/qemu/103" -> (known after apply)
      ~ linked_vmid               = 0 -> (known after apply)
        name                      = "prod-zbbx-02"
      - numa                      = false -> null
      ~ reboot_required           = false -> (known after apply)
      - sockets                   = 0 -> null
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
        tags                      = "prod;terraform;zabbix;zabbix-server"
      ~ unused_disk               = [] -> (known after apply)
      - vcpus                     = 0 -> null
      ~ vm_state                  = "stopped" -> "running"
        # (38 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide0 {
                  - ignore = false -> null

                    # (1 unchanged block hidden)
                }
            }
          ~ virtio {
              ~ virtio0 {
                  - ignore = false -> null

                  ~ disk {
                      - discard              = false -> null
                      ~ id                   = 0 -> (known after apply)
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (19 unchanged attributes hidden)
                    }
                }
              ~ virtio1 {
                  - ignore = false -> null

                  ~ disk {
                      - discard              = false -> null
                      ~ id                   = 1 -> (known after apply)
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (19 unchanged attributes hidden)
                    }
                }
            }
        }

      ~ network {
            id        = 0
          ~ macaddr   = "bc:24:11:39:c8:ef" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }
      ~ network {
            id        = 1
          ~ macaddr   = "bc:24:11:e9:45:dc" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      ~ smbios (known after apply)
      - smbios {
          - uuid         = "1b6c5033-a06c-474d-aaec-fa4d2ede9677" -> null
            # (6 unchanged attributes hidden)
        }

      - vga {
          - memory = 0 -> null
          - type   = "serial0" -> null
        }
      + vga {
          + type = "serial0"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

Changes to Outputs:
  + zabbix_servers__prod             = [
      + {
          + description       = "Zabbix Server. This VM is managed by Terraform."
          + ethernet_adapters = {
              + ip0 = {
                  + bridge     = "vmbr1"
                  + ip_address = "192.168.21.5/24"
                }
              + ip1 = {
                  + bridge     = "vmbr2"
                  + ip_address = "192.168.91.1/29"
                }
            }
          + host_name         = (known after apply)
          + id                = 102
          + name              = "prod-zbbx-01"
        },
      + {
          + description       = "Zabbix Server. This VM is managed by Terraform."
          + ethernet_adapters = {
              + ip0 = {
                  + bridge     = "vmbr1"
                  + ip_address = "192.168.21.6/24"
                }
              + ip1 = {
                  + bridge     = "vmbr2"
                  + ip_address = "192.168.91.2/29"
                }
            }
          + host_name         = (known after apply)
          + id                = 103
          + name              = "prod-zbbx-02"
        },
    ]
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"tf_plan","PRNumber":264,"Program":"tfcmt","SHA1":"9c0e8a29c5b3ce6478f170c7b8bfa00e7213b355","Vars":{},"WorkflowName":"Terraform CI"} -->